/**
 * @author ZZP
 * @version 1.1.0
 */


public class Test {
    public static void main(String[] args){
        // 2的补码 00000000 00000000 00000000 00000010
        // 3的补码 00000000 00000000 00000000 00000011
        // 2｜3为  00000000 00000000 00000000 00000011 -> 3
//        System.out.println(2|3);

        // 2的补码 00000000 00000000 00000000 00000010
        // 3的补码 00000000 00000000 00000000 00000011
        // 2^3    00000000 00000000 00000000 00000001 -> 1
//        System.out.println(2^3);

        // 2的补码 00000000 00000000 00000000 00000010
        // 3的补码 00000000 00000000 00000000 00000011
        // 2&3    00000000 00000000 00000000 00000010
//        System.out.println(2&3);

        String s1 = "123";
        String s2 = "123";
        System.out.println(s1.equals(s2));
        System.out.println(s1 == s2);
        s1.replace("1", "5");
        System.out.println(s1 + " " + s2);
    }
}
